In [2]:
#Previous learning go through

In [11]:
name = ['ali','hamza','saad']

In [12]:
for i in range(2):
    name.append(input('Enter your name:'))

Enter your name:
Enter your name:

In [15]:
for names in name:
    print(names)

ali
hamza
saad

In [6]:
name

['ali', 'hamza', 'saad', 'muniba', 'zaid']

In [7]:
#Pandas ek libarary hai
#pandas mai bht sari numpy hai
#numpy mai hm ek wqt mai ek entity pr work karsakte the
#Thats why introduce pandas ko lekar aye jo numpy ko use karke bht sari entity pr ek sth work karsakta hai
#Indexing facility mojood hai.
#Indexing date time entity bhi ho sakti hai

In [8]:
import pandas as pd

In [4]:
#pandas mai 2 structure bht use hote hain series and data frame
#series:
    #Single dimension to store single value store series mai esi kia advantage hai
    #ke hm numpy ki jaga series ko prefer kar rehe hain
    #series hm waha use 
    #pandas mai maximum operation 2d hote hain..
    #Indexing verstaile mil jati hia
#data frame mai hm bta sakte hain karachi country mai konsi date mai kon sa data 
#hai but numpy mai nhi pta chalta
#group of numpy mil kar pandas bna rehe hain

In [17]:
school_fee = [[50000,25000,30000],[15000,20000,25000]]

In [18]:
country_temp = [[[42,40,18]]]

In [5]:
import numpy as np

In [6]:
np.array([[[42,40,18]]])

array([[[42, 40, 18]]])

In [11]:
#value return list
#Basically index object hote hain
#index kis liye create kar rehe hain efficiently use karne ke liye

In [1]:
import pandas as pd

In [8]:
#series mai object create
khi_temp = pd.Series([32,24,15,10,25])
khi_temp

0    32
1    24
2    15
3    10
4    25
dtype: int64

In [5]:
khi_temp.values

array([32, 24, 15, 10, 25], dtype=int64)

In [6]:
khi_temp.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
khi_temp = pd.Series([32,24,15,10,25],index = [1,2,3,4,5])

In [10]:
khi_temp

1    32
2    24
3    15
4    10
5    25
dtype: int64

In [12]:
khi_temp.index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [13]:
khi_temp[2]

24

In [14]:
khi_temp[2] = 35

In [15]:
khi_temp

1    32
2    35
3    15
4    10
5    25
dtype: int64

In [18]:
#multiple index value
#jis order mai provide kia hota hai usi base pr value excess hoti hain

In [19]:
khi_temp[[2,3,4]]

2    35
3    15
4    10
dtype: int64

In [20]:
khi_temp[1:3]

2    35
3    15
dtype: int64

In [21]:
khi_temp = pd.Series([32,24,15,10,25,32,52,45,23,29])

In [22]:
khi_temp

0    32
1    24
2    15
3    10
4    25
5    32
6    52
7    45
8    23
9    29
dtype: int64

In [23]:
#boolean prediction
khi_temp>25

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8    False
9     True
dtype: bool

In [25]:
#boolean indexing
khi_temp[khi_temp>25]

0    32
5    32
6    52
7    45
9    29
dtype: int64

In [26]:
khi_temp ** 2

0    1024
1     576
2     225
3     100
4     625
5    1024
6    2704
7    2025
8     529
9     841
dtype: int64

In [28]:
khi_temp_dic = {'10.00' : 35,'11:00' : 36,'12:00': 38,'13:00':40}

In [31]:
#Series mai dic as a argument pas kar rehe hain
khi_temps = pd.Series(khi_temp_dic)

In [32]:
#time index ban gaya
khi_temps

10.00    35
11:00    36
12:00    38
13:00    40
dtype: int64

In [34]:
khi_temps.values

array([35, 36, 38, 40], dtype=int64)

In [70]:
khi_temp_dic = {'10:00' : 35,'11:00' : 36,'12:00': 38,'13:00':40}

In [72]:
khi_temps = pd.Series(khi_temp_dic)
khi_temps

10:00    35
11:00    36
12:00    38
13:00    40
dtype: int64

In [48]:
#list ke through
khi_tempr = pd.Series([12,25,36,26],index=['10:00','11:00','12:00','09:00'])

In [49]:
khi_tempr

10:00    12
11:00    25
12:00    36
09:00    26
dtype: int64

In [64]:
khi_tempr = pd.Series(khi_temp_dic,index=['10:00','11:00','12:00','09:00'])

In [65]:
khi_tempr

10:00    35.0
11:00    36.0
12:00    38.0
09:00     NaN
dtype: float64

In [69]:
khi_tempr.isnull()

10:00    False
11:00    False
12:00    False
09:00     True
dtype: bool

In [73]:
lhr_temps_dict = {'10:00' : 35,'11:00' : 36,'12:00': 38,'13:00':40}

In [74]:
lhr_temps = pd.Series(lhr_temps_dict)

In [75]:
lhr_temps

10:00    35
11:00    36
12:00    38
13:00    40
dtype: int64

In [77]:
#agr ap ke pas ek series object mai value hai or dusre series object mai value nhi hai
#to wo nan hi show hi kare ga
khi_tempr + lhr_temps

09:00     NaN
10:00    70.0
11:00    72.0
12:00    76.0
13:00     NaN
dtype: float64

In [78]:
#Names
khi_tempr.name = 'khi_temperature_data'

In [79]:
khi_tempr

10:00    35.0
11:00    36.0
12:00    38.0
09:00     NaN
Name: khi_temperature_data, dtype: float64

In [85]:
khi_tempr.index.name = 'khi_time'

In [86]:
khi_tempr

khi_time
10:00    35.0
11:00    36.0
12:00    38.0
09:00     NaN
Name: khi_temperature_data, dtype: float64

# DATA FRAMES

In [ ]:
#A DataFrame represents a rectangular table of data and contains an ordered collec‐
#tion of columns, each of which can be a different value type (numeric, string,
#boolean, etc.).#data type same

In [87]:
students = pd.DataFrame([{'name': 'fayyas','age':26},{'name':'Meera','age':36},{'name':'Sadiq','age':22}])

In [88]:
students

   age    name
0   26  fayyas
1   36   Meera
2   22   Sadiq

In [89]:
#DATA FRAME
#horizontally excess
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [92]:
frame = pd.DataFrame(data)

In [93]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [94]:
 #DataFrames head method
#head return milliom of data

In [95]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [97]:
frame.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [98]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
  index=['one', 'two', 'three', 'four', 'five', 'six'])

In [103]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [104]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [106]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [125]:
#loc return row
frame2.loc

In [126]:
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [127]:
frame2.loc[['one','two','three']]

       year state  pop  debt
one    2000  Ohio  1.5   NaN
two    2001  Ohio  1.7  -1.2
three  2002  Ohio  3.6   NaN

In [128]:
#is mai value inclusive hoti hai
frame2.loc['one':'three']

       year state  pop  debt
one    2000  Ohio  1.5   NaN
two    2001  Ohio  1.7  -1.2
three  2002  Ohio  3.6   NaN

In [129]:
frame2['debt']

one      NaN
two     -1.2
three    NaN
four    -1.5
five    -1.7
six      NaN
Name: debt, dtype: float64

In [130]:
frame2['debt'] = 16.5
frame2['debt']

one      16.5
two      16.5
three    16.5
four     16.5
five     16.5
six      16.5
Name: debt, dtype: float64

In [131]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [132]:
#value override
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [133]:
frame2['debt'] = val

In [134]:
#jo index ki value data series pr nhi hai waha NAN ajaye ga
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [137]:
#Jb column create karne ja rehe hote hain to . notation nhi use kar sakte lazmi 
#hai square bracket use karen
frame2['income'] = 10.5

In [138]:
frame2

       year   state  pop  debt  income
one    2000    Ohio  1.5   NaN    10.5
two    2001    Ohio  1.7  -1.2    10.5
three  2002    Ohio  3.6   NaN    10.5
four   2001  Nevada  2.4  -1.5    10.5
five   2002  Nevada  2.9  -1.7    10.5
six    2003  Nevada  3.2   NaN    10.5

In [140]:
#new columns create karsakte hain data frame ki help se
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  income  eastern
one    2000    Ohio  1.5   NaN    10.5     True
two    2001    Ohio  1.7  -1.2    10.5     True
three  2002    Ohio  3.6   NaN    10.5     True
four   2001  Nevada  2.4  -1.5    10.5    False
five   2002  Nevada  2.9  -1.7    10.5    False
six    2003  Nevada  3.2   NaN    10.5    False

In [141]:
del frame2['eastern']
frame2

       year   state  pop  debt  income
one    2000    Ohio  1.5   NaN    10.5
two    2001    Ohio  1.7  -1.2    10.5
three  2002    Ohio  3.6   NaN    10.5
four   2001  Nevada  2.4  -1.5    10.5
five   2002  Nevada  2.9  -1.7    10.5
six    2003  Nevada  3.2   NaN    10.5

In [148]:
#same work use only dictionary(3rd Method)
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [149]:
frame3 = pd.DataFrame(pop)

In [150]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [151]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [152]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [153]:
distance = (20,50)

In [154]:
distance[0]

20

In [155]:
distance[0] = 30

TypeError: 'tuple' object does not support item assignment

In [156]:
distance = (10,20,30,40)

In [157]:
distance

(10, 20, 30, 40)

In [158]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [159]:
obj

a    0
b    1
c    2
dtype: int64

In [160]:
obj.index[0]

'a'

In [162]:
obj.index[0] = 'k' #not change value

TypeError: Index does not support mutable operations

In [163]:
obj.index  = ['j','k','l']

In [164]:
obj

j    0
k    1
l    2
dtype: int64

In [165]:
obj.index  = ['k','k','l']

In [166]:
obj

k    0
k    1
l    2
dtype: int64

In [169]:
#duplicate indexing allow
obj.index

Index(['k', 'k', 'l'], dtype='object')

In [170]:
obj.loc['k']

k    0
k    1
dtype: int64

In [171]:
#REINDEXING
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [172]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [173]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [174]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [175]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [176]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [178]:
#values back fill kardeta hai
obj3.reindex(range(6),method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [179]:
obj3.reindex(range(6),method = 'bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [180]:
#drop return new datastructure return karta hai

In [181]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [182]:
frame.index = ['a','b', 'c','d','e','f']

In [183]:
frame.loc[['b','c']]

  state  year  pop
b  Ohio  2001  1.7
c  Ohio  2002  3.6

In [184]:
frame.loc[['b','c'],['year','pop']]

   year  pop
b  2001  1.7
c  2002  3.6

In [186]:
#index ki value de rha hai
frame.iloc[0]

state    Ohio
year     2000
pop       1.5
Name: a, dtype: object

#Reindexing

In [2]:
import pandas as pd
#missing indexing ke liye hm reindexing karte hain
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [ ]:
# Forward-fills the values:

In [4]:
#Agr dataframe mai index mai integer -1 mai hai to wo last value nhi blke value utha kar laye ga

In [5]:
import numpy as np

In [9]:
arr1= np.arange(24)

In [10]:
arr1

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23])

In [11]:
#broadcasting differnt dimension ko copy karta hai
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [12]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
 index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [13]:
frame

               b         d         e
Utah    0.125362  0.300645  0.897715
Ohio    1.184870 -0.499581  0.784401
Texas  -0.763915 -1.031773  0.090109
Oregon  0.263591  0.575501 -0.914360

In [14]:
#Apply work for row and column 
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.948785
d    1.607274
e    1.812075
dtype: float64

In [ ]:
f = lambda x: x.mean()

In [20]:
def f2(x):
    print('f2 called')
    return x.max() - x.min()

In [23]:
print(frame.apply(f2, axis=1))

f2 called
f2 called
f2 called
f2 called
Utah      0.772353
Ohio      1.684451
Texas     1.121883
Oregon    1.489861
dtype: float64

In [24]:
print(frame.apply(f2, axis=0))

f2 called
f2 called
f2 called
b    1.948785
d    1.607274
e    1.812075
dtype: float64

In [15]:
#horizontally
frame.apply(f, axis='columns')

Utah      0.772353
Ohio      1.684451
Texas     1.121883
Oregon    1.489861
dtype: float64

In [16]:
#hr value ke upper work karna chah rehe to apply map use kare ge
format = lambda x: '%.2f' % x

In [17]:
frame.applymap(format)

            b      d      e
Utah     0.13   0.30   0.90
Ohio     1.18  -0.50   0.78
Texas   -0.76  -1.03   0.09
Oregon   0.26   0.58  -0.91

In [25]:
obj1 = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [27]:
obj1.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [28]:
obj1

d    0
a    1
b    2
c    3
dtype: int64

In [29]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
 index=['three', 'one'],
 columns=['d', 'a', 'b', 'c'])

In [30]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [31]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [33]:
obj3 = pd.Series([4, 7, -3, 2])

In [34]:
obj3.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [35]:
obj4 = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [36]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [37]:
frame3 = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [38]:
frame3

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [40]:
frame3.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [41]:
frame3.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [43]:
obj4 = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [44]:
obj4.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [45]:
obj4.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [47]:
obj4 = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [48]:
obj4

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [50]:
obj4['c']

4

In [51]:
obj4['a']

a    0
a    1
dtype: int64

In [52]:
obj5 = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [53]:
obj5

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [54]:
obj5 = pd.Series(np.random.rand(13))

In [55]:
obj5

0     0.897642
1     0.382849
2     0.219220
3     0.482336
4     0.406795
5     0.539557
6     0.975877
7     0.181380
8     0.234688
9     0.198414
10    0.502529
11    0.702286
12    0.140290
dtype: float64

In [57]:
obj5[0] = obj5[4]

In [59]:
obj5

0     0.406795
1     0.382849
2     0.219220
3     0.482336
4     0.406795
5     0.539557
6     0.975877
7     0.181380
8     0.234688
9     0.198414
10    0.502529
11    0.702286
12    0.140290
dtype: float64

In [60]:
obj6 = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [61]:
obj6

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [62]:
obj6.index.is_unique

False

In [63]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
[np.nan, np.nan], [0.75, -1.3]],
 index=['a', 'b', 'c', 'd'],
 columns=['one', 'two'])

In [64]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [66]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [67]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [70]:
#describe
#INfo 
#Head
#Tail
#best prac
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
one    3 non-null float64
two    2 non-null float64
dtypes: float64(2)
memory usage: 256.0+ bytes

# Correlation and Covariance

In [72]:
#ek attribute kisi dusre attribute pr kitna dependent hai
#do cheeze ek dusre ke relationship mai hai
#kia ek ke change pr dusre ke change pr effect hota hai
#Covariance
#Covariance mai ke ek ke change hone pr dusre pr kitna effect pr raha hai
#covariance pr kitna zyada change arha hai

In [79]:
import pandas_datareader.data as web
#next class

ModuleNotFoundError: No module named 'pandas_datareader'

In [80]:
obj6 = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [78]:
obj6

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [81]:
uniques = obj6.unique()

In [82]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [ ]:
#isin particular index ke uper value excess karti hain ya nhi.